QuangHaiNguyen/Oscilloscope_STM32F746/touchgfx/board/ST/STM32429I-EVAL1/source/vendor/stm324x9i_eval_audio_codec.c
  /*!< While the bus is busy */
  CODECTimeout = CODEC_LONG_TIMEOUT;
  while(I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BUSY))
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }
  
  /* Start the config sequence */
  I2C_GenerateSTART(CODEC_I2C, ENABLE);

  /* Test on EV5 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(CODEC_I2C, CODEC_ADDRESS, I2C_Direction_Transmitter);

  /* Test on EV6 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }

  /* Transmit the register address to be read (MSB fist)*/
  I2C_SendData(CODEC_I2C, (uint8_t)(RegisterAddr >> 8));
  
    /* Test on EV6 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING))
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }

  /* Transmit the register address to be read (LSB)*/
  I2C_SendData(CODEC_I2C, (uint8_t)(RegisterAddr));

  /* Test on EV8 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BTF) == RESET)
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }
  
  /* Send STRAT condition a second time */  
  I2C_GenerateSTART(CODEC_I2C, ENABLE);
  
  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while(!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  } 
  
  /* Send Codec address for read */
  I2C_Send7bitAddress(CODEC_I2C, CODEC_ADDRESS, I2C_Direction_Receiver);  
  
  /* Wait on ADDR flag to be set (ADDR is still not cleared at this level */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while(I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_ADDR) == RESET)
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }     
  
  /* Disable Acknowledgment */
  I2C_AcknowledgeConfig(CODEC_I2C, DISABLE); 
  I2C_NACKPositionConfig(CODEC_I2C, I2C_NACKPosition_Next);
  
  /* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
  (void)CODEC_I2C->SR2;
  
  /* Test on EV8 and clear it */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while (I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BTF) == RESET)
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }
  
  /*!< Send STOP Condition */
  I2C_GenerateSTOP(CODEC_I2C, ENABLE);
  
  /* Recive MSB first from the Codec */
  result = I2C_ReceiveData(CODEC_I2C);
  result = result << 8;

  /* Recive LSB from the Codec */
  result |= I2C_ReceiveData(CODEC_I2C);
  
  /* Wait to make sure that STOP flag has been cleared */
  CODECTimeout = CODEC_FLAG_TIMEOUT;
  while(CODEC_I2C->CR1 & I2C_CR1_STOP)
  {
    if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
  }  
  
  /*!< Re-Enable Acknowledgment to be ready for another reception */
  I2C_AcknowledgeConfig(CODEC_I2C, ENABLE);  
  
  /*!< Disable Acknowledgment position */
  I2C_NACKPositionConfig(CODEC_I2C, I2C_NACKPosition_Current);
    
  /* Clear AF flag for next communication */
  I2C_ClearFlag(CODEC_I2C, I2C_FLAG_AF); 
  
  /* Return the byte read from Codec */
  return result;
}

/**
  * @brief  Initializes the Audio Codec control interface (I2C).
  * @param  None
  * @retval None
  */
static void Codec_CtrlInterface_Init(void)
{
  I2C_InitTypeDef I2C_InitStructure;
  
  /* Enable the CODEC_I2C peripheral clock */
  RCC_APB1PeriphClockCmd(CODEC_I2C_CLK, ENABLE);
  
  /* CODEC_I2C peripheral configuration */
  I2C_DeInit(CODEC_I2C);
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_OwnAddress1 = 0x33;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
  
  /* Initialize the I2C peripheral */
  I2C_Init(CODEC_I2C, &I2C_InitStructure);    
  
  /* Enable the I2C peripheral */
  I2C_Cmd(CODEC_I2C, ENABLE);  
}

/**
  * @brief  Restore the Audio Codec control interface to its default state.
  *         This function doesn't de-initialize the I2C because the I2C peripheral
  *         may be used by other modules.
  * @param  None
  * @retval None
  */
static void Codec_CtrlInterface_DeInit(void)
{
  /* Disable the I2C peripheral */ 
  /* This step is not done here because the I2C interface can be used by other modules */
  /* I2C_DeInit(CODEC_I2C); */
}

/**
  * @brief  Initializes the Audio Codec audio interface (SAI)
  * @note   This function assumes that the SAI input clock (through PLLSAI)
  *         is already configured and ready to be used.    
  * @param  AudioFreq: Audio frequency to be configured for the SAI peripheral. 
  * @retval None
  */
static void Codec_AudioInterface_Init(uint32_t AudioFreq)
{
 uint32_t tmpdiv;
  
 SAI_InitTypeDef       SAI_InitStructure;
 SAI_FrameInitTypeDef  SAI_FrameInitStructure;
 SAI_SlotInitTypeDef   SAI_SlotInitStructure;
 
  /* Enable the CODEC_SAI peripheral clock */
  RCC_APB2PeriphClockCmd(CODEC_SAI_CLK, ENABLE);
   
  /* Configure Master Clock using the following formula :
  MCLK_x = SAI_CK_x / (MCKDIV[3:0] * 2) with MCLK_x = 256 * FS
  FS = SAI_CK_x / (MCKDIV[3:0] * 2) * 256
  MCKDIV[3:0] = SAI_CK_x / FS * 512 */  
  tmpdiv = SAI_CLOCK_SOURCE / (AudioFreq * 512);
   
  SAI_InitStructure.SAI_NoDivider = SAI_MasterDivider_Enabled;
  SAI_InitStructure.SAI_MasterDivider = tmpdiv;
  
  /* Configure SAI_Block_x 
  LSBFirst : Disabled 
  DataSize : 16 */
  SAI_InitStructure.SAI_AudioMode = SAI_Mode_MasterTx;
  SAI_InitStructure.SAI_Protocol = SAI_Free_Protocol;
  SAI_InitStructure.SAI_DataSize = SAI_DataSize_16b;
  SAI_InitStructure.SAI_FirstBit = SAI_FirstBit_MSB;
  SAI_InitStructure.SAI_ClockStrobing = SAI_ClockStrobing_RisingEdge;
  SAI_InitStructure.SAI_Synchro = SAI_Asynchronous;
  SAI_InitStructure.SAI_OUTDRIV = SAI_OutputDrive_Enabled;
  SAI_InitStructure.SAI_FIFOThreshold = SAI_FIFOThreshold_1QuarterFull;
  SAI_Init(CODEC_SAI, &SAI_InitStructure);
  
  /* Configure SAI_Block_x Frame 
  Frame Length : 32
  Frame active Length: 16
  FS Definition : Start frame + Channel Side identification
  FS Polarity: FS active Low
  FS Offset: FS asserted one bit before the first bit of slot 0 */ 
  SAI_FrameInitStructure.SAI_FrameLength = 64;
  SAI_FrameInitStructure.SAI_ActiveFrameLength = 32;  
  SAI_FrameInitStructure.SAI_FSDefinition = I2S_FS_ChannelIdentification;
  SAI_FrameInitStructure.SAI_FSPolarity = SAI_FS_ActiveLow;  
  SAI_FrameInitStructure.SAI_FSOffset = SAI_FS_BeforeFirstBit;
  SAI_FrameInit(CODEC_SAI, &SAI_FrameInitStructure);
  
  /* Configure SAI Block_x Slot 
  Slot First Bit Offset : 0
  Slot Size   : 16
  Slot Number : 4
  Slot Active : All slot actives */
  SAI_SlotInitStructure.SAI_FirstBitOffset = 0;
  SAI_SlotInitStructure.SAI_SlotSize = SAI_SlotSize_16b; 
  SAI_SlotInitStructure.SAI_SlotSize = SAI_SlotSize_DataSize;
  SAI_SlotInitStructure.SAI_SlotNumber = 4;
  SAI_SlotInitStructure.SAI_SlotActive = USR_SAI_SlotActive;
  SAI_SlotInit(CODEC_SAI, &SAI_SlotInitStructure); 
  
  SAI_FlushFIFO(CODEC_SAI);
  
  /* Mono Mode Config */
#ifdef MONO_MODE
    SAI_MonoModeConfig(CODEC_SAI, SAI_MonoMode);
#endif /* MONO_MODE */
  
  /* The SAI peripheral will be enabled only in the EVAL_AUDIO_Play() function 
       or by user functions if DMA mode not enabled */  
}

/**
  * @brief  Restores the Audio Codec audio interface to its default state.
  * @param  None
  * @retval None
  */
static void Codec_AudioInterface_DeInit(void)
{
  /* Disable the CODEC_SAI peripheral (in case it hasn't already been disabled) */
  SAI_Cmd(CODEC_SAI, DISABLE);
  
